poc_all/other/hpe-bladesystem-onboard-administrator_2.yaml

id: hpe-bladesystem-onboard-administrator
info:
  author: milo2012
  description: Fingerprint HPE BladeSystem Onboard Administrator
  name: HPE BladeSystem Onboard Administrator
  severity: info
  tags: tech,hpe
http:
- extractors:
  - group: 1
    part: body
    regex:
    - <hpoa:version>(.*?)</hpoa
    type: regex
  matchers:
  - status:
    - 200
    type: status
  - part: body
    type: word
    words:
    - hpoa:soapInterfaceInfo
    - hpoa:manufacturer
  matchers-condition: and
  raw:
  - "POST /hpoa HTTP/1.1\nHost: {{Hostname}}\n\n<?xml version=\"1.0\" encoding=\"\
    UTF-8\"?>\n<SOAP-ENV:Envelope\n        xmlns:SOAP-ENV=\"http://www.w3.org/2003/05/soap-envelope\"\
    \n        xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"\n        xmlns:xsd=\"\
    http://www.w3.org/2001/XMLSchema\"\n        xmlns:wsu=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd\"\
    \n        xmlns:wsse=\"http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd\"\
    \n        xmlns:hpoa=\"hpoa.xsd\">\n        <SOAP-ENV:Body>\n              <hpoa:getSoapInterfaceInfo/>\n\
    \        </SOAP-ENV:Body>\n</SOAP-ENV:Envelope>\n"
